#### 《利用python进行数据分析》第六章

In [5]:
import numpy as np
import pandas as pd
from numpy import nan as NA

In [6]:
df = pd.DataFrame(np.random.rand(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0  0.406759       NaN       NaN
1  0.157626       NaN       NaN
2  0.613341       NaN  0.001800
3  0.313255       NaN  0.397078
4  0.436928  0.989291  0.086376
5  0.674110  0.822776  0.756186
6  0.951890  0.027246  0.533449

In [8]:
df.dropna()

          0         1         2
4  0.436928  0.989291  0.086376
5  0.674110  0.822776  0.756186
6  0.951890  0.027246  0.533449

In [9]:
df.dropna(thresh=2)

          0         1         2
2  0.613341       NaN  0.001800
3  0.313255       NaN  0.397078
4  0.436928  0.989291  0.086376
5  0.674110  0.822776  0.756186
6  0.951890  0.027246  0.533449